01_Wave_InitialFlat_FineMesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sedFoam_rbgh;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         60; //40;

deltaT          2e-4;

writeControl    adjustableRunTime;

writeInterval   0.1; //0.001; //0.25;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep yes;

maxCo          0.1;

maxAlphaCo     0.1;

maxDeltaT      1e-2; //5e-4

functions
{
probesVel
{
        type probes;

        probeLocations
        (
                (0.0 0.119 0.0)
        );

        fields
        (
            U.b
            alpha.a
        );
};
}


libs (
	"libOpenFOAM.so"
	"libsimpleFunctionObjects.so"
	"libsimpleSwakFunctionObjects.so"
	"libswakFunctionObjects.so"
	);

OptimisationSwitches
    {
      //- Parallel IO file handler
      // uncollated (default), collated or masterUncollated
      fileHandler collated;

      //- collated: thread buffer size for queued file writes.
      // If set to 0 or not sufficient for the file size threading is not used.
      // Default: 2e9
      maxThreadFileBufferSize 0;

      //- masterUncollated: non-blocking buffer size.
      // If the file exceeds this buffer size scheduled transfer is used.
      // Default: 2e9
      maxMasterFileBufferSize 2e9;
    }

// ************************************************************************* //
